app/views/users/show.html.erb

SELECT COUNT(*) FROM "thoughts" WHERE ("thoughts".user_id = 2)
---

                  <%if @user.thoughts.any? %>