app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("user_id", "friend_id", "status", "accepted_at", "created_at", "updated_at") VALUES (2, 1, 0, NULL, '2011-04-25 14:15:45.259332', '2011-04-25 14:15:45.259332')
---
  def create
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    if @friendship.save

SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = 1 AND ("friendships".user_id = 3) LIMIT 1
DELETE FROM "friendships" WHERE "friendships"."id" = 1
---
  def destroy
    @friendship = current_user.friendships.find(params[:id])
    @friendship.destroy