app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ('gh', 1, '2011-02-28 14:33:40.166521', '2011-02-28 14:33:40.166521')