app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "thoughts".* FROM "thoughts" WHERE ("thoughts".user_id = 1) ORDER BY thoughts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "thoughts" WHERE ("thoughts".user_id = 1)
---
  def show
    @user = User.find(params[:id])
    @thoughts = @user.thoughts.paginate(:page => params[:page])

UPDATE "users" SET "name" = 'Lol!!!', "updated_at" = '2011-02-28 15:13:33.655334' WHERE "users"."id" = 101
---
  def update

    if @user.update_attributes(params[:user])