app/views/thoughts/_thought.html.erb

    <span class="timestamp">
      Posted <%= time_ago_in_words(thought.created_at) %> ago.
    </span>
---
INSERT INTO "thoughts" ("content", "user_id", "created_at", "updated_at") VALUES ('---